Revit 2027 API
Concrete.ConcreteSealant Property
 The property labeled "Sealant" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConcreteSealant { get; }
Public Shared ReadOnly Property ConcreteSealant As String
	Get
public:
static property String^ ConcreteSealant {
	String^ get ();
}
static member ConcreteSealant : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteSealantType".
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace